authz_benchmark/jmeter_report/k8s_1ng_1j_3r_2400t_600e_4cpu_async2_https_http2/h2load.out
starting benchmark...
spawning thread #0: 2400 total client(s). Timing-based test with 0s of warm-up time and 900s of main duration for measurements.
Warm-up started for thread #0.
progress: 10% of clients started
progress: 20% of clients started
progress: 30% of clients started
progress: 40% of clients started
progress: 50% of clients started
progress: 60% of clients started
progress: 70% of clients started
progress: 80% of clients started
progress: 90% of clients started
progress: 100% of clients started
Warm-up phase is over for thread #0.
Main benchmark duration is started for thread #0.
TLS Protocol: TLSv1.3
Cipher: TLS_AES_256_GCM_SHA384
Server Temp Key: X25519 253 bits
Application protocol: h2
Main benchmark duration is over for thread #0. Stopping all clients.
Stopped all clients for thread #0

finished in 900.61s, 2758.85 req/s, 20.74MB/s
requests: 2482966 total, 2485366 started, 2482966 done, 2482966 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 2482966 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 18.23GB (19570991305) total, 241.53MB (253262532) headers (space savings 32.00%), 17.91GB (19228088704) data
                     min         max         mean         sd        +/- sd
time for request:   123.13ms      10.98s    863.62ms    247.18ms    99.23%
time for connect:   192.94ms       1.40s    860.62ms    319.05ms    57.96%
time to 1st byte:      1.08s       5.45s       2.20s    928.80ms    60.71%
req/s           :       1.14        1.15        1.15        0.00    60.83%